MycosoftLabs/mycosoft-mas/firmware/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK.ino
/*
  ESP32-S3 + Dual BME688 (AMB/ENV) using Bosch BSEC2 + Bosch BME68x library
  - No Adafruit libs required
  - CLI: help, scan, i2c, live, status, probe, regs, dbg, rate, fmt
         poster, morgio, coin, bump, power, 1up
         led mode off|state|manual, led rgb <r> <g> <b>

  - Auto-detects BME688 at 0x77 (AMB) and 0x76 (ENV)
  - Separate BSEC2 instances per sensor (separate memory/state)
  - Per-sensor output lines (no nulls); NDJSON option for Azure
  - Pressure scaling auto-normalized

  Boot reliability:
  - Adds a boot wait so Serial Monitor has time to attach (ESP32-S3 USB CDC quirks)
  - 'poster' command reprints the screen any time

  Indicator lights:
  - Uses AO_PINS[0..2] (12/13/14) as PWM RGB indicators (0-255)
  - Default: LED state machine enabled (led mode state)
    - GREEN  : both sensors begin ok + subscription ok
    - YELLOW : begin ok but subscription failed for any
    - BLUE   : initializing / waiting for first valid readings
    - RED    : no sensors or begin failed
*/

#include <Arduino.h>
#include <Wire.h>
#include "bsec2.h"

#ifndef ARRAY_LEN
  #define ARRAY_LEN(x) (sizeof(x) / sizeof((x)[0]))
#endif

// -------------------------
// OPTIONAL external blob header (sketch tab)
// -------------------------
#define USE_EXTERNAL_BLOB 0  // set to 1 ONLY if you're sure blob matches your BSEC2 lib

#if USE_EXTERNAL_BLOB
  #include "bsec_selectivity.h" // must define: bsec_selectivity_config[] and *_len
  static const uint8_t*  CFG_PTR = bsec_selectivity_config;
  static const uint32_t  CFG_LEN = (uint32_t)bsec_selectivity_config_len;
#else
  static const uint8_t*  CFG_PTR = nullptr;
  static const uint32_t  CFG_LEN = 0;
#endif

// -------------------------
// Pinout (your A-side notes)
// -------------------------
static const int PIN_SDA   = 5;
static const int PIN_SCL   = 4;

static const int AIN_PINS[4] = {6, 7, 10, 11};

// AO pins double as “indicator lights” (PWM RGB)
static const int AO_PINS[3]  = {12, 13, 14}; // R,G,B channels (0-255)

static const int BUZZER_PIN  = 16;

// -------------------------
// Boot / Serial behavior
// -------------------------
// If Serial Monitor connects late, you miss the first prints.
// This gives you a deterministic window to catch the banner.
static const uint32_t BOOT_SERIAL_WAIT_MS = 1800;

// -------------------------
// I2C defaults
// -------------------------
static uint8_t  gSda   = PIN_SDA;
static uint8_t  gScl   = PIN_SCL;
static uint32_t gI2cHz = 100000;

// -------------------------
// Output format
// -------------------------
enum OutputFormat : uint8_t {
  FMT_LINES = 0,
  FMT_NDJSON = 1
};
static OutputFormat gFmt = FMT_LINES;

// -------------------------
// Debug toggles
// -------------------------
static bool     gDebug = true;
static uint32_t gLastDbgPrintMs = 0;
static uint32_t gDbgPeriodMs = 3000;

// -------------------------
// UI state
// -------------------------
static bool     gLive = true;
static uint32_t gLastLiveMs = 0;
static uint32_t gLivePeriodMs = 1000;

// -------------------------
// Data structs (MUST be above functions that use them)
// -------------------------
struct AmbReading {
  bool     valid = false;
  uint32_t t_ms  = 0;

  float tC = NAN;
  float rh = NAN;

  float p_raw = NAN;
  float p_hPa = NAN;
  float gas_ohm = NAN;

  float iaq = NAN;
  float iaqAccuracy = NAN;
  float staticIaq = NAN;
  float co2eq = NAN;
  float voc = NAN;
};

struct SensorSlot {
  const char* name;
  uint8_t addr;

  bool present = false;

  Bsec2 bsec;
  uint8_t mem[BSEC_INSTANCE_SIZE];

  bool beginOk = false;
  bool subOk   = false;
  bool cfgOk   = false;
  int  lastStatus = 0;

  float sampleRate = BSEC_SAMPLE_RATE_LP;

  AmbReading r;
};

// Two fixed “slots” by address
static SensorSlot S_AMB = { "AMB", 0x77 };
static SensorSlot S_ENV = { "ENV", 0x76 };

// -------------------------
// Blocky POST screen (ASCII-only)
// -------------------------
static const char kPoster[] =
"====================================================================\n"
"  SuperMorgIO\n"
"  Mycosoft ESP32AB\n"
"====================================================================\n"
"   ###############################\n"
"   #                             #\n"
"   #      _   _  ____  ____      #\n"
"   #     | \\ | ||  _ \\|  _ \\     #\n"
"   #     |  \\| || |_) | |_) |    #\n"
"   #     | |\\  ||  __/|  __/     #\n"
"   #     |_| \\_||_|   |_|        #\n"
"   #                             #\n"
"   #   (blocky Morgan render)    #\n"
"   #      [=]   [=]              #\n"
"   #        \\___/                #\n"
"   #      __/|||\\__              #\n"
"   #     /__|||||__\\             #\n"
"   #                             #\n"
"   ###############################\n"
"--------------------------------------------------------------------\n"
"  Commands: help | poster | morgio | coin | bump | power | 1up\n"
"  LED: led mode off|state|manual  | led rgb <r> <g> <b>\n"
"--------------------------------------------------------------------\n";

// -------------------------
// Indicator lights
// -------------------------
enum LedMode : uint8_t { LEDMODE_OFF = 0, LEDMODE_STATE = 1, LEDMODE_MANUAL = 2 };
static LedMode gLedMode = LEDMODE_STATE;

static uint8_t gLedR = 0, gLedG = 0, gLedB = 0; // manual values

static void ledWriteRGB(uint8_t r, uint8_t g, uint8_t b) {
  analogWrite(AO_PINS[0], r);
  analogWrite(AO_PINS[1], g);
  analogWrite(AO_PINS[2], b);
}

static void ledAllOff() {
  ledWriteRGB(0, 0, 0);
}

static void ledBootBlink() {
  ledWriteRGB(0, 0, 50); delay(80);
  ledWriteRGB(0, 50, 0); delay(80);
  ledWriteRGB(50, 0, 0); delay(60);
  ledWriteRGB(0, 0, 0);  delay(60);
}

static void ledStateUpdate() {
  if (gLedMode == LEDMODE_OFF) {
    ledAllOff();
    return;
  }
  if (gLedMode == LEDMODE_MANUAL) {
    ledWriteRGB(gLedR, gLedG, gLedB);
    return;
  }

  const bool ambPresent = S_AMB.present;
  const bool envPresent = S_ENV.present;
  const bool anyPresent = ambPresent || envPresent;

  const bool ambBegin = S_AMB.beginOk;
  const bool envBegin = S_ENV.beginOk;
  const bool anyBeginFail = (ambPresent && !ambBegin) || (envPresent && !envBegin);

  const bool ambSub = S_AMB.subOk;
  const bool envSub = S_ENV.subOk;
  const bool anySubFail = (ambPresent && ambBegin && !ambSub) || (envPresent && envBegin && !envSub);

  const bool ambData = S_AMB.r.valid;
  const bool envData = S_ENV.r.valid;
  const bool initPhase = anyPresent && ((ambPresent && !ambData) || (envPresent && !envData));

  if (!anyPresent) {
    uint8_t v = (uint8_t)(20 + (millis() / 6) % 80);
    ledWriteRGB(v, 0, 0);
    return;
  }

  if (anyBeginFail) {
    bool on = ((millis() / 250) % 2) == 0;
    ledWriteRGB(on ? 120 : 0, 0, 0);
    return;
  }

  if (initPhase) {
    uint8_t v = (uint8_t)(30 + (millis() / 8) % 90);
    ledWriteRGB(0, 0, v);
    return;
  }

  if (anySubFail) {
    ledWriteRGB(80, 60, 0);
    return;
  }

