MycosoftLabs/mycosoft-mas/firmware/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK.ino
  ledWriteRGB(0, 90, 0);
}

// -------------------------
// Helpers
// -------------------------
static void beepOnce(int freqHz = 2000, int ms = 60) {
  tone(BUZZER_PIN, freqHz, ms);
}

static void printPoster() {
  Serial.println();
  Serial.print(kPoster);
  Serial.println();
}

// -------------------------
// SuperMorgIO: retro buzzer music kit (original “platformer vibe”)
// -------------------------
static int noteHz(const char* n) {
  if (!n) return 0;
  if (!strcmp(n, "REST")) return 0;

  if (!strcmp(n, "C4")) return 262;
  if (!strcmp(n, "CS4")) return 277;
  if (!strcmp(n, "D4")) return 294;
  if (!strcmp(n, "DS4")) return 311;
  if (!strcmp(n, "E4")) return 330;
  if (!strcmp(n, "F4")) return 349;
  if (!strcmp(n, "FS4")) return 370;
  if (!strcmp(n, "G4")) return 392;
  if (!strcmp(n, "GS4")) return 415;
  if (!strcmp(n, "A4")) return 440;
  if (!strcmp(n, "AS4")) return 466;
  if (!strcmp(n, "B4")) return 494;

  if (!strcmp(n, "C5")) return 523;
  if (!strcmp(n, "CS5")) return 554;
  if (!strcmp(n, "D5")) return 587;
  if (!strcmp(n, "DS5")) return 622;
  if (!strcmp(n, "E5")) return 659;
  if (!strcmp(n, "F5")) return 698;
  if (!strcmp(n, "FS5")) return 740;
  if (!strcmp(n, "G5")) return 784;
  if (!strcmp(n, "GS5")) return 831;
  if (!strcmp(n, "A5")) return 880;
  if (!strcmp(n, "AS5")) return 932;
  if (!strcmp(n, "B5")) return 988;

  if (!strcmp(n, "C6")) return 1047;
  if (!strcmp(n, "D6")) return 1175;
  if (!strcmp(n, "E6")) return 1319;

  return 0;
}

static void playTone(int hz, int ms, int gapMs = 8) {
  if (hz > 0) {
    tone(BUZZER_PIN, hz);
    delay(ms);
    noTone(BUZZER_PIN);
  } else {
    delay(ms);
  }
  if (gapMs > 0) delay(gapMs);
}

static void playNote(const char* n, int ms, int gapMs = 8) {
  playTone(noteHz(n), ms, gapMs);
}

static void sfxCoin() { playNote("E6", 35, 5); playNote("B5", 25, 0); }
static void sfxBump() { playNote("C5", 40, 0); playNote("REST", 10, 0); playNote("C5", 25, 0); }

static void sfxPowerUp() {
  playNote("C5", 60); playNote("E5", 60); playNote("G5", 80);
  playNote("C6", 120, 0);
}

static void sfx1Upish() {
  playNote("E5", 60); playNote("G5", 60); playNote("A5", 60);
  playNote("C6", 140, 0);
}

static void sfxSuperMorgIOBoot() {
  const int q = 120;
  const int e = q / 2;
  const int s = q / 4;

  playNote("C5", s); playNote("E5", s); playNote("G5", s); playNote("C6", e);
  playNote("REST", s);

  playNote("D5", s); playNote("F5", s); playNote("A5", s); playNote("D6", e);
  playNote("REST", s);

  playNote("E5", e); playNote("G5", e); playNote("B5", e);
  playNote("A5", s); playNote("G5", s); playNote("E5", s); playNote("C5", s);

  playNote("D5", e); playNote("G5", e); playNote("C5", q);
}

// -------------------------
// Core info
// -------------------------
static void printCoreInfo() {
  Serial.println("--- CORE / SDK ---");
#if defined(ESP_ARDUINO_VERSION_MAJOR)
  Serial.printf("Arduino-ESP32 core: %d.%d.%d\n",
                ESP_ARDUINO_VERSION_MAJOR,
                ESP_ARDUINO_VERSION_MINOR,
                ESP_ARDUINO_VERSION_PATCH);
#else
  Serial.println("Arduino-ESP32 core: (ESP_ARDUINO_VERSION_* not defined)");
#endif
  Serial.printf("ESP SDK: %s\n", ESP.getSdkVersion());
  Serial.printf("Chip model: %s\n", ESP.getChipModel());
  Serial.printf("CPU freq: %u MHz\n", ESP.getCpuFreqMHz());
  Serial.println("---------------");
}

// -------------------------
// I2C helpers
// -------------------------
static bool i2cReadBytes(uint8_t addr, uint8_t reg, uint8_t* out, size_t n) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;
  size_t got = Wire.requestFrom((int)addr, (int)n);
  if (got != n) return false;
  for (size_t i = 0; i < n; i++) out[i] = Wire.read();
  return true;
}

static bool i2cRead8(uint8_t addr, uint8_t reg, uint8_t &val) {
  return i2cReadBytes(addr, reg, &val, 1);
}

static void printI2cScan() {
  Serial.println("I2C scan:");
  int found = 0;
  for (uint8_t a = 1; a < 127; a++) {
    Wire.beginTransmission(a);
    uint8_t err = Wire.endTransmission();
    if (err == 0) {
      Serial.printf("  found: 0x%02X\n", a);
      found++;
    }
  }
  if (!found) Serial.println("  (none)");
}

static float pressureToHpa(float p) {
  if (!isfinite(p) || p <= 0) return NAN;
  if (p > 20000.0f) return p / 100.0f;  // Pa -> hPa
  if (p > 2000.0f)  return p / 10.0f;   // deci-hPa -> hPa
  if (p > 200.0f)   return p;           // already hPa
  if (p > 20.0f)    return p * 10.0f;   // kPa -> hPa
  return p * 1000.0f;                   // bar-ish -> hPa
}

static void printBmeIdentity(uint8_t addr, int repeats = 3) {
  Serial.printf("--- BME ID probe @ 0x%02X ---\n", addr);
  for (int i = 0; i < repeats; i++) {
    uint8_t chip = 0, var = 0;
    bool ok1 = i2cRead8(addr, 0xD0, chip);
    bool ok2 = i2cRead8(addr, 0xF0, var);
    Serial.printf("  #%d chip_id: %s 0x%02X | variant_id: %s 0x%02X\n",
                  i + 1,
                  ok1 ? "OK" : "FAIL", chip,
                  ok2 ? "OK" : "FAIL", var);
    delay(25);
  }
  Serial.println("------------------------");
}

static SensorSlot* pickSlotByName(const String &s) {
  String t = s; t.toLowerCase();
  if (t == "amb") return &S_AMB;
  if (t == "env") return &S_ENV;
  return nullptr;
}

static void snapStatus(SensorSlot &s, const char* tag) {
  s.lastStatus = (int)s.bsec.status;
  Serial.printf("[%s %s] BSEC status=%d\n", s.name, tag, s.lastStatus);
}

// -------------------------
// Output formatting
// -------------------------
static void printOneSensorLine(const SensorSlot &s) {
  if (!s.present || !s.r.valid) return;

  uint32_t age = millis() - s.r.t_ms;

  Serial.printf("%s addr=0x%02X age=%lums T=%.2fC RH=%.2f%% P=%.2fhPa(raw=%.2f) Gas=%.0fOhm",
                s.name, s.addr, (unsigned long)age,
                s.r.tC, s.r.rh, s.r.p_hPa, s.r.p_raw, s.r.gas_ohm);

  if (!isnan(s.r.iaq)) {
    Serial.printf(" IAQ=%.2f acc=%.0f sIAQ=%.2f CO2eq=%.2f VOC=%.2f",
                  s.r.iaq, s.r.iaqAccuracy, s.r.staticIaq, s.r.co2eq, s.r.voc);
  } else {
    Serial.print(" IAQ=N/A");
  }

  Serial.println();
}

static void printOneSensorNdjson(const SensorSlot &s) {
  if (!s.present || !s.r.valid) return;

  uint32_t ts = millis();

  Serial.print("{\"ts_ms\":"); Serial.print(ts);
  Serial.print(",\"sensor\":\""); Serial.print(s.name); Serial.print("\"");
  Serial.print(",\"addr\":\"0x"); Serial.printf("%02X", s.addr); Serial.print("\"");

  Serial.print(",\"tC\":"); Serial.print(s.r.tC, 2);
  Serial.print(",\"rh\":"); Serial.print(s.r.rh, 2);
  Serial.print(",\"p_hPa\":"); Serial.print(s.r.p_hPa, 2);
  Serial.print(",\"gas\":"); Serial.print(s.r.gas_ohm, 0);

