MycosoftLabs/mycosoft-mas/firmware/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK.ino
  if (!isnan(s.r.iaq)) {
    Serial.print(",\"iaq\":"); Serial.print(s.r.iaq, 2);
    Serial.print(",\"acc\":"); Serial.print(s.r.iaqAccuracy, 0);
    Serial.print(",\"siaq\":"); Serial.print(s.r.staticIaq, 2);
    Serial.print(",\"co2eq\":"); Serial.print(s.r.co2eq, 2);
    Serial.print(",\"voc\":"); Serial.print(s.r.voc, 2);
  }

  Serial.println("}");
}

static void liveOutput() {
  if (gFmt == FMT_LINES) {
    Serial.println("===== LIVE =====");
    if (S_AMB.present) printOneSensorLine(S_AMB);
    if (S_ENV.present) printOneSensorLine(S_ENV);
    Serial.println("===============");
  } else {
    if (S_AMB.present) printOneSensorNdjson(S_AMB);
    if (S_ENV.present) printOneSensorNdjson(S_ENV);
  }
}

// -------------------------
// BSEC callbacks (one per slot)
// -------------------------
static void slotCallbackCommon(SensorSlot &s, const bme68xData data, const bsecOutputs outputs) {
  s.r.valid = true;
  s.r.t_ms  = millis();

  s.r.tC = data.temperature;
  s.r.rh = data.humidity;

  s.r.p_raw = (float)data.pressure;
  s.r.p_hPa = pressureToHpa(s.r.p_raw);

  s.r.gas_ohm = (float)data.gas_resistance;

  s.r.iaq = NAN;
  s.r.iaqAccuracy = NAN;
  s.r.staticIaq = NAN;
  s.r.co2eq = NAN;
  s.r.voc = NAN;

  for (uint8_t i = 0; i < outputs.nOutputs; i++) {
    const bsecData &o = outputs.output[i];
    switch (o.sensor_id) {
      case BSEC_OUTPUT_IAQ:
        s.r.iaq = o.signal;
        s.r.iaqAccuracy = (float)o.accuracy;
        break;
      case BSEC_OUTPUT_STATIC_IAQ:
        s.r.staticIaq = o.signal;
        break;
      case BSEC_OUTPUT_CO2_EQUIVALENT:
        s.r.co2eq = o.signal;
        break;
      case BSEC_OUTPUT_BREATH_VOC_EQUIVALENT:
        s.r.voc = o.signal;
        break;
      default:
        break;
    }
  }

  if (gDebug && (millis() - gLastDbgPrintMs >= gDbgPeriodMs)) {
    gLastDbgPrintMs = millis();
    Serial.printf("[DBG %s] rawP=%.2f => P=%.2f hPa | T=%.2f RH=%.2f Gas=%.0f | iaq=%s acc=%.0f\n",
                  s.name, s.r.p_raw, s.r.p_hPa, s.r.tC, s.r.rh, s.r.gas_ohm,
                  isnan(s.r.iaq) ? "N/A" : String(s.r.iaq, 2).c_str(),
                  isnan(s.r.iaqAccuracy) ? -1.0f : s.r.iaqAccuracy);
  }
}

static void cbAMB(const bme68xData data, const bsecOutputs outputs, const Bsec2 /*bsec*/) {
  slotCallbackCommon(S_AMB, data, outputs);
}
static void cbENV(const bme68xData data, const bsecOutputs outputs, const Bsec2 /*bsec*/) {
  slotCallbackCommon(S_ENV, data, outputs);
}

// -------------------------
// Sensor init
// -------------------------
static bool slotInit(SensorSlot &s) {
  s.present = false;
  s.beginOk = s.subOk = s.cfgOk = false;
  s.lastStatus = 0;
  s.r = AmbReading();

  Wire.beginTransmission(s.addr);
  if (Wire.endTransmission() != 0) {
    Serial.printf("[%s] not found @ 0x%02X\n", s.name, s.addr);
    return false;
  }
  s.present = true;

  printBmeIdentity(s.addr, 2);

  s.bsec.allocateMemory(s.mem);

  Serial.printf("[%s] begin(0x%02X)...\n", s.name, s.addr);
  if (!s.bsec.begin(s.addr, Wire)) {
    Serial.printf("[%s] begin FAILED\n", s.name);
    snapStatus(s, "begin");
    return false;
  }
  s.beginOk = true;
  Serial.printf("[%s] begin OK\n", s.name);
  snapStatus(s, "begin");

  s.bsec.setTemperatureOffset(0.0f);

  if (CFG_PTR && CFG_LEN) {
    Serial.printf("[%s] setConfig(blob %lu bytes)...\n", s.name, (unsigned long)CFG_LEN);
    if (!s.bsec.setConfig(CFG_PTR)) {
      Serial.printf("[%s] setConfig FAILED\n", s.name);
      snapStatus(s, "setConfig");
      s.cfgOk = false;
    } else {
      Serial.printf("[%s] setConfig OK\n", s.name);
      snapStatus(s, "setConfig");
      s.cfgOk = true;
    }
  } else {
    Serial.printf("[%s] setConfig skipped\n", s.name);
    snapStatus(s, "setConfig-skip");
    s.cfgOk = false;
  }

  if (s.addr == 0x77) s.bsec.attachCallback(cbAMB);
  if (s.addr == 0x76) s.bsec.attachCallback(cbENV);

  bsecSensor list[] = {
    BSEC_OUTPUT_IAQ,
    BSEC_OUTPUT_STATIC_IAQ,
    BSEC_OUTPUT_CO2_EQUIVALENT,
    BSEC_OUTPUT_BREATH_VOC_EQUIVALENT
  };

  Serial.printf("[%s] updateSubscription(%s)...\n", s.name,
                (s.sampleRate == BSEC_SAMPLE_RATE_LP) ? "LP" : "ULP");

  if (s.bsec.updateSubscription(list, (uint8_t)ARRAY_LEN(list), s.sampleRate)) {
    Serial.printf("[%s] updateSubscription OK\n", s.name);
    snapStatus(s, "sub");
    s.subOk = true;
  } else {
    Serial.printf("[%s] updateSubscription FAILED\n", s.name);
    snapStatus(s, "sub-fail");
    s.subOk = false;
  }

  return true;
}

static bool initAll() {
  Wire.end();
  Wire.begin(gSda, gScl);
  Wire.setClock(gI2cHz);

  Serial.printf("I2C: SDA=%d SCL=%d @ %lu Hz\n", gSda, gScl, (unsigned long)gI2cHz);
  printI2cScan();

  // init phase indicator
  if (gLedMode == LEDMODE_STATE) ledWriteRGB(0, 0, 90);

  bool any = false;
  if (slotInit(S_AMB)) any = true;
  if (slotInit(S_ENV)) any = true;

  Serial.println("----- STARTER BUNDLE -----");
  Serial.printf("I2C: SDA=%d SCL=%d @ %lu Hz\n", gSda, gScl, (unsigned long)gI2cHz);
  Serial.printf("CFG blob len: %lu\n", (unsigned long)CFG_LEN);

  Serial.printf("AMB: present=%s addr=0x%02X begin=%s sub=%s status=%d rate=%s\n",
                S_AMB.present ? "YES":"NO", S_AMB.addr,
                S_AMB.beginOk ? "OK":"FAIL",
                S_AMB.subOk ? "OK":"FAIL",
                S_AMB.lastStatus,
                (S_AMB.sampleRate == BSEC_SAMPLE_RATE_LP) ? "LP":"ULP");

  Serial.printf("ENV: present=%s addr=0x%02X begin=%s sub=%s status=%d rate=%s\n",
                S_ENV.present ? "YES":"NO", S_ENV.addr,
                S_ENV.beginOk ? "OK":"FAIL",
                S_ENV.subOk ? "OK":"FAIL",
                S_ENV.lastStatus,
                (S_ENV.sampleRate == BSEC_SAMPLE_RATE_LP) ? "LP":"ULP");

  Serial.println("--------------------------");

  return any;
}

// -------------------------
// CLI
// -------------------------
static void printHelp() {
  Serial.println();
  Serial.println("Commands:");
  Serial.println("  help                               - this help");
  Serial.println("  poster                             - reprint SuperMorgIO POST screen");
  Serial.println("  morgio                             - play SuperMorgIO boot jingle");
  Serial.println("  coin | bump | power | 1up          - tiny retro SFX");
  Serial.println("  scan                               - I2C scan");
  Serial.println("  i2c <sda> <scl> [hz]               - set I2C pins + optional clock");
  Serial.println("  live on|off                        - periodic live output");
  Serial.println("  status                             - init stages + readings");
  Serial.println("  probe amb|env [n]                  - read chip_id/variant_id (default n=3)");
  Serial.println("  regs amb|env                       - read chip_id/variant_id once");
  Serial.println("  dbg on|off                         - toggle callback debug prints");
  Serial.println("  fmt lines|json                     - output format (human lines or NDJSON)");
  Serial.println("  rate amb|env lp|ulp                - set per-sensor sample rate and re-init");
  Serial.println("  led mode off|state|manual          - indicator lights mode");
  Serial.println("  led rgb <r 0-255> <g 0-255> <b 0-255> - set manual RGB (auto -> manual)");
  Serial.println();
}

static void printStatus() {
  printCoreInfo();

  Serial.printf("I2C: SDA=%d SCL=%d @ %lu Hz\n", gSda, gScl, (unsigned long)gI2cHz);
  Serial.printf("Format=%s Debug=%s Live=%s period=%lums\n",
                (gFmt == FMT_LINES) ? "lines":"json",
                gDebug ? "on":"off",
                gLive ? "on":"off",
                (unsigned long)gLivePeriodMs);

  const char* lm = (gLedMode == LEDMODE_OFF) ? "off" : (gLedMode == LEDMODE_STATE) ? "state" : "manual";
  Serial.printf("LED mode=%s  manual rgb=%u,%u,%u\n", lm, gLedR, gLedG, gLedB);

