MycosoftLabs/mycosoft-mas/firmware/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK/startHERE_ESP32AB_BSEC2_WORKING_DUAL_morgio_BLOCK.ino
  Serial.printf("AMB: present=%s addr=0x%02X begin=%s sub=%s status=%d rate=%s\n",
                S_AMB.present ? "YES":"NO", S_AMB.addr,
                S_AMB.beginOk ? "OK":"FAIL",
                S_AMB.subOk ? "OK":"FAIL",
                S_AMB.lastStatus,
                (S_AMB.sampleRate == BSEC_SAMPLE_RATE_LP) ? "LP":"ULP");

  Serial.printf("ENV: present=%s addr=0x%02X begin=%s sub=%s status=%d rate=%s\n",
                S_ENV.present ? "YES":"NO", S_ENV.addr,
                S_ENV.beginOk ? "OK":"FAIL",
                S_ENV.subOk ? "OK":"FAIL",
                S_ENV.lastStatus,
                (S_ENV.sampleRate == BSEC_SAMPLE_RATE_LP) ? "LP":"ULP");

  if (S_AMB.present && S_AMB.r.valid) printOneSensorLine(S_AMB);
  if (S_ENV.present && S_ENV.r.valid) printOneSensorLine(S_ENV);
}

static String gLine;

static void handleCommand(String line) {
  line.trim();
  if (!line.length()) return;

  auto nextTok = [&](int &pos) -> String {
    while (pos < (int)line.length() && isspace((unsigned char)line[pos])) pos++;
    int start = pos;
    while (pos < (int)line.length() && !isspace((unsigned char)line[pos])) pos++;
    return line.substring(start, pos);
  };

  int pos = 0;
  String cmd = nextTok(pos);
  cmd.toLowerCase();

  if (cmd == "help" || cmd == "?") { printHelp(); return; }
  if (cmd == "poster") { printPoster(); return; }

  if (cmd == "morgio" || cmd == "morg") { sfxSuperMorgIOBoot(); return; }
  if (cmd == "coin") { sfxCoin(); return; }
  if (cmd == "bump") { sfxBump(); return; }
  if (cmd == "power") { sfxPowerUp(); return; }
  if (cmd == "1up") { sfx1Upish(); return; }

  if (cmd == "scan") { printI2cScan(); return; }

  if (cmd == "led") {
    String sub = nextTok(pos); sub.toLowerCase();
    if (sub == "mode") {
      String m = nextTok(pos); m.toLowerCase();
      if (m == "off") gLedMode = LEDMODE_OFF;
      else if (m == "state") gLedMode = LEDMODE_STATE;
      else if (m == "manual") gLedMode = LEDMODE_MANUAL;
      Serial.printf("LED mode set to %s\n", (gLedMode==LEDMODE_OFF)?"off":(gLedMode==LEDMODE_STATE)?"state":"manual");
      return;
    }
    if (sub == "rgb") {
      String sr = nextTok(pos), sg = nextTok(pos), sb = nextTok(pos);
      if (!sr.length() || !sg.length() || !sb.length()) {
        Serial.println("Usage: led rgb <r> <g> <b>");
        return;
      }
      gLedR = (uint8_t)constrain(sr.toInt(), 0, 255);
      gLedG = (uint8_t)constrain(sg.toInt(), 0, 255);
      gLedB = (uint8_t)constrain(sb.toInt(), 0, 255);
      gLedMode = LEDMODE_MANUAL;
      Serial.printf("LED manual rgb=%u,%u,%u\n", gLedR, gLedG, gLedB);
      return;
    }
    Serial.println("Usage: led mode off|state|manual  OR  led rgb <r> <g> <b>");
    return;
  }

  if (cmd == "i2c") {
    String sSda = nextTok(pos);
    String sScl = nextTok(pos);
    String sHz  = nextTok(pos);
    if (sSda.length()) gSda = (uint8_t)sSda.toInt();
    if (sScl.length()) gScl = (uint8_t)sScl.toInt();
    if (sHz.length())  gI2cHz = (uint32_t)sHz.toInt();
    Serial.println("Re-initializing...");
    initAll();
    return;
  }

  if (cmd == "live") {
    String v = nextTok(pos);
    v.toLowerCase();
    if (v == "on") gLive = true;
    else if (v == "off") gLive = false;
    Serial.printf("LIVE=%s\n", gLive ? "on" : "off");
    return;
  }

  if (cmd == "status") { printStatus(); return; }

  if (cmd == "dbg") {
    String v = nextTok(pos);
    v.toLowerCase();
    if (v == "on") gDebug = true;
    else if (v == "off") gDebug = false;
    Serial.printf("DBG=%s\n", gDebug ? "on" : "off");
    return;
  }

  if (cmd == "fmt") {
    String v = nextTok(pos);
    v.toLowerCase();
    if (v == "lines") gFmt = FMT_LINES;
    else if (v == "json") gFmt = FMT_NDJSON;
    Serial.printf("FMT=%s\n", (gFmt == FMT_LINES) ? "lines" : "json");
    return;
  }

  if (cmd == "probe" || cmd == "regs") {
    String which = nextTok(pos);
    SensorSlot* s = pickSlotByName(which);
    if (!s) {
      Serial.println("Usage: probe amb|env [n]  OR regs amb|env");
      return;
    }
    int n = 1;
    if (cmd == "probe") {
      String sn = nextTok(pos);
      n = sn.length() ? sn.toInt() : 3;
      n = constrain(n, 1, 20);
    }
    printBmeIdentity(s->addr, n);
    return;
  }

  if (cmd == "rate") {
    String which = nextTok(pos);
    String rate  = nextTok(pos);
    SensorSlot* s = pickSlotByName(which);
    if (!s) {
      Serial.println("Usage: rate amb|env lp|ulp");
      return;
    }
    rate.toLowerCase();
    if (rate == "lp") s->sampleRate = BSEC_SAMPLE_RATE_LP;
    else if (rate == "ulp") s->sampleRate = BSEC_SAMPLE_RATE_ULP;
    else {
      Serial.println("rate must be lp or ulp");
      return;
    }
    Serial.println("Re-initializing...");
    initAll();
    return;
  }

  Serial.printf("Unknown cmd: %s (try 'help')\n", cmd.c_str());
}

// -------------------------
// Arduino setup/loop
// -------------------------
void setup() {
  pinMode(BUZZER_PIN, OUTPUT);

  Serial.begin(115200);

  // Give the host time to attach the monitor after reset/upload.
  // This is the big “serial doesn’t print” fix.
  delay(BOOT_SERIAL_WAIT_MS);

  for (int i = 0; i < 4; i++) pinMode(AIN_PINS[i], INPUT);

  // Setup “indicator lights” on AO pins
  for (int i = 0; i < 3; i++) {
    pinMode(AO_PINS[i], OUTPUT);
    analogWriteResolution(AO_PINS[i], 8);  // esp32 core 3.2.0 requires pin + bits
    analogWrite(AO_PINS[i], 0);
  }

  ledBootBlink();

  // Boot POST + jingle
  printPoster();
  sfxSuperMorgIOBoot();

  Serial.println("ESP32AB A-SIDE Dual BME688 (AMB/ENV) + BSEC2");
  printCoreInfo();
  printHelp();

  initAll();
}

static void runSlot(SensorSlot &s) {
  if (!s.present || !s.beginOk) return;
  (void)s.bsec.run();
}

void loop() {
  while (Serial.available()) {
    char c = (char)Serial.read();
    if (c == '\r') continue;
    if (c == '\n') {
      String line = gLine;
      gLine = "";
      handleCommand(line);
    } else {
      if (gLine.length() < 200) gLine += c;
    }
  }

  runSlot(S_AMB);
  runSlot(S_ENV);

  // Keep indicator lights alive
  ledStateUpdate();

  if (gLive && millis() - gLastLiveMs >= gLivePeriodMs) {
    gLastLiveMs = millis();
    liveOutput();
  }
}
